---
type: TessellatedShapeBuilderResult
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# TessellatedShapeBuilderResult

`Autodesk.Revit.DB.TessellatedShapeBuilderResult` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetGeometricalObjects | 2015 | `public IList < GeometryObject > GetGeometricalObjects ()` |
| Method | GetIssuesForFaceSet | 2015 | `public IList < TessellatedBuildIssue > GetIssuesForFaceSet ( int setIndex )` |
| Method | GetNumberOfFaceSets | 2015 | `public int GetNumberOfFaceSets ()` |
| Property | AreObjectsAvailable | 2015 | `public bool AreObjectsAvailable { get ; }` |
| Property | HasInvalidData | 2015 | `public bool HasInvalidData { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Outcome | 2015 | `public TessellatedShapeBuilderOutcome Outcome { get ; }` |